{
    "0": 1,
    "0.0": 2,
    "0.0005532503457814661": 3,
    "0.0008294166436273154": 4,
    "0.0016260162601626016": 5,
    "0.0018214936247723133": 6,
    "0.0019353055017970694": 7,
    "0.0019363762102351315": 8,
    "0.001996007984031936": 9,
    "0.002072538860103627": 10,
    "0.0020964360587002098": 11,
    "0.0021231422505307855": 12,
    "0.002325581395348837": 13,
    "0.002564102564102564": 14,
    "0.0027100271002710027": 15,
    "0.0027472527472527475": 16,
    "0.0027548209366391185": 17,
    "0.002770083102493075": 18,
    "0.002785515320334262": 19,
    "0.002824858757062147": 20,
    "0.0028328611898017": 21,
    "0.002849002849002849": 22,
    "0.002932551319648094": 23,
    "0.0029498525073746312": 24,
    "0.002967359050445104": 25,
    "0.0029985007496251873": 26,
    "0.0030303030303030303": 27,
    "0.0033222591362126247": 28,
    "0.0034482758620689655": 29,
    "0.0036429872495446266": 30,
    "0.003663003663003663": 31,
    "0.003676470588235294": 32,
    "0.0036900369003690036": 33,
    "0.00392156862745098": 34,
    "0.004032258064516129": 35,
    "0.004048582995951417": 36,
    "0.00411522633744856": 37,
    "0.004132231404958678": 38,
    "0.004201680672268907": 39,
    "0.0043859649122807015": 40,
    "0.004424778761061947": 41,
    "0.0044444444444444444": 42,
    "0.004651162790697674": 43,
    "0.004672897196261682": 44,
    "0.0047169811320754715": 45,
    "0.004761904761904762": 46,
    "0.004878048780487805": 47,
    "0.0049261083743842365": 48,
    "0.0049504950495049506": 49,
    "0.004975124378109453": 50,
    "0.005050505050505051": 51,
    "0.00510204081632653": 52,
    "0.005128205128205128": 53,
    "0.0051813471502590676": 54,
    "0.005252972076306331": 55,
    "0.0052558782849239285": 56,
    "0.005263157894736842": 57,
    "0.005291005291005291": 58,
    "0.005319148936170213": 59,
    "0.005405405405405406": 60,
    "0.005449591280653951": 61,
    "0.00546448087431694": 62,
    "0.005494505494505495": 63,
    "0.005555555555555556": 64,
    "0.0056179775280898875": 65,
    "0.005691056910569106": 66,
    "0.005714285714285714": 67,
    "0.005747126436781609": 68,
    "0.005780346820809248": 69,
    "0.005813953488372093": 70,
    "0.005917159763313609": 71,
    "0.005952380952380952": 72,
    "0.005988023952095809": 73,
    "0.006024096385542169": 74,
    "0.006097560975609756": 75,
    "0.006172839506172839": 76,
    "0.006211180124223602": 77,
    "0.006289308176100629": 78,
    "0.006329113924050633": 79,
    "0.00641025641025641": 80,
    "0.0064516129032258064": 81,
    "0.006535947712418301": 82,
    "0.006578947368421052": 83,
    "0.006622516556291391": 84,
    "0.006644518272425249": 85,
    "0.006666666666666667": 86,
    "0.00684931506849315": 87,
    "0.006944444444444444": 88,
    "0.006993006993006993": 89,
    "0.007042253521126761": 90,
    "0.007142857142857143": 91,
    "0.007192254495159059": 92,
    "0.007464749792645839": 93,
    "0.007751937984496124": 94,
    "0.007782101167315175": 95,
    "0.00784313725490196": 96,
    "0.008064516129032258": 97,
    "0.008130081300813009": 98,
    "0.008264462809917356": 99,
    "0.008403361344537815": 100,
    "0.008450704225352112": 101,
    "0.0084985835694051": 102,
    "0.008547008547008548": 103,
    "0.008583690987124463": 104,
    "0.008620689655172414": 105,
    "0.008695652173913044": 106,
    "0.008771929824561403": 107,
    "0.008797653958944282": 108,
    "0.008849557522123894": 109,
    "0.008888888888888889": 110,
    "0.008902077151335312": 111,
    "0.008928571428571428": 112,
    "0.009009009009009009": 113,
    "0.009174311926605505": 114,
    "0.009216589861751152": 115,
    "0.009259259259259259": 116,
    "0.009345794392523364": 117,
    "0.009433962264150943": 118,
    "0.009523809523809525": 119,
    "0.009615384615384616": 120,
    "0.009708737864077669": 121,
    "0.00975609756097561": 122,
    "0.00980392156862745": 123,
    "0.009852216748768473": 124,
    "0.009900990099009901": 125,
    "0.010101010101010102": 126,
    "0.01015228426395939": 127,
    "0.01020408163265306": 128,
    "0.010256410256410256": 129,
    "0.010309278350515464": 130,
    "0.010344827586206896": 131,
    "0.010362694300518135": 132,
    "0.010416666666666666": 133,
    "0.010471204188481676": 134,
    "0.010526315789473684": 135,
    "0.010582010582010581": 136,
    "0.0106951871657754": 137,
    "0.010752688172043012": 138,
    "0.010810810810810811": 139,
    "0.010830324909747292": 140,
    "0.010869565217391304": 141,
    "0.010899182561307902": 142,
    "0.01092896174863388": 143,
    "0.01098901098901099": 144,
    "0.011019283746556474": 145,
    "0.01107011070110701": 146,
    "0.0110803324099723": 147,
    "0.011111111111111112": 148,
    "0.011142061281337047": 149,
    "0.011235955056179775": 150,
    "0.011299435028248588": 151,
    "0.0113314447592068": 152,
    "0.011363636363636364": 153,
    "0.011396011396011397": 154,
    "0.011428571428571429": 155,
    "0.011494252873563218": 156,
    "0.011560693641618497": 157,
    "0.011627906976744186": 158,
    "0.011673151750972763": 159,
    "0.011730205278592375": 160,
    "0.011764705882352941": 161,
    "0.011904761904761904": 162,
    "0.011976047904191617": 163,
    "0.012048192771084338": 164,
    "0.012121212121212121": 165,
    "0.012145748987854251": 166,
    "0.012195121951219513": 167,
    "0.012345679012345678": 168,
    "0.012422360248447204": 169,
    "0.0125": 170,
    "0.012578616352201259": 171,
    "0.012658227848101266": 172,
    "0.012779552715654952": 173,
    "0.01282051282051282": 174,
    "0.012875536480686695": 175,
    "0.012903225806451613": 176,
    "0.012987012987012988": 177,
    "0.013071895424836602": 178,
    "0.013157894736842105": 179,
    "0.013245033112582781": 180,
    "0.013289036544850499": 181,
    "0.013333333333333334": 182,
    "0.013513513513513514": 183,
    "0.013623978201634877": 184,
    "0.0136986301369863": 185,
    "0.013793103448275862": 186,
    "0.013861386138613862": 187,
    "0.013888888888888888": 188,
    "0.013972055888223553": 189,
    "0.013986013986013986": 190,
    "0.014084507042253521": 191,
    "0.014124293785310734": 192,
    "0.014285714285714285": 193,
    "0.01444043321299639": 194,
    "0.014492753623188406": 195,
    "0.014507772020725389": 196,
    "0.014634146341463415": 197,
    "0.014675052410901468": 198,
    "0.014705882352941176": 199,
    "0.014861995753715499": 200,
    "0.014925373134328358": 201,
    "0.01509433962264151": 202,
    "0.015267175572519083": 203,
    "0.015503875968992248": 204,
    "0.01556420233463035": 205,
    "0.015625": 206,
    "0.01568627450980392": 207,
    "0.015706806282722512": 208,
    "0.015873015873015872": 209,
    "0.016042780748663103": 210,
    "0.016129032258064516": 211,
    "0.016216216216216217": 212,
    "0.016304347826086956": 213,
    "0.01639344262295082": 214,
    "0.016483516483516484": 215,
    "0.01652892561983471": 216,
    "0.016666666666666666": 217,
    "0.016771488469601678": 218,
    "0.01680672268907563": 219,
    "0.016853932584269662": 220,
    "0.01694915254237288": 221,
    "0.016985138004246284": 222,
    "0.0169971671388102": 223,
    "0.017094017094017096": 224,
    "0.017241379310344827": 225,
    "0.017543859649122806": 226,
    "0.017699115044247787": 227,
    "0.017857142857142856": 228,
    "0.017964071856287425": 229,
    "0.017985611510791366": 230,
    "0.017991004497751123": 231,
    "0.01818181818181818": 232,
    "0.018292682926829267": 233,
    "0.018315018315018316": 234,
    "0.01834862385321101": 235,
    "0.01845018450184502": 236,
    "0.018518518518518517": 237,
    "0.018633540372670808": 238,
    "0.018691588785046728": 239,
    "0.01875": 240,
    "0.01881720430107527": 241,
    "0.018867924528301886": 242,
    "0.01904761904761905": 243,
    "0.01910828025477707": 244,
    "0.019230769230769232": 245,
    "0.01935483870967742": 246,
    "0.019417475728155338": 247,
    "0.01951219512195122": 248,
    "0.0196078431372549": 249,
    "0.019736842105263157": 250,
    "0.019801980198019802": 251,
    "0.01984126984126984": 252,
    "0.019867549668874173": 253,
    "0.02": 254,
    "0.020161290322580645": 255,
    "0.020202020202020204": 256,
    "0.02027027027027027": 257,
    "0.02030456852791878": 258,
    "0.02032520325203252": 259,
    "0.02040816326530612": 260,
    "0.020477815699658702": 261,
    "0.020833333333333332": 262,
    "0.020942408376963352": 263,
    "0.02097902097902098": 264,
    "0.021052631578947368": 265,
    "0.02127659574468085": 266,
    "0.0213903743315508": 267,
    "0.02142857142857143": 268,
    "0.02185792349726776": 269,
    "0.022058823529411766": 270,
    "0.02214022140221402": 271,
    "0.022222222222222223": 272,
    "0.022284122562674095": 273,
    "0.022388059701492536": 274,
    "0.022406639004149378": 275,
    "0.02247191011235955": 276,
    "0.022535211267605635": 277,
    "0.022670721592479955": 278,
    "0.022727272727272728": 279,
    "0.022900763358778626": 280,
    "0.022988505747126436": 281,
    "0.02304147465437788": 282,
    "0.023255813953488372": 283,
    "0.0234375": 284,
    "0.02346041055718475": 285,
    "0.023529411764705882": 286,
    "0.023668639053254437": 287,
    "0.023809523809523808": 288,
    "0.023952095808383235": 289,
    "0.024": 290,
    "0.024096385542168676": 291,
    "0.024193548387096774": 292,
    "0.024271844660194174": 293,
    "0.024390243902439025": 294,
    "0.024691358024691357": 295,
    "0.024793388429752067": 296,
    "0.024822695035460994": 297,
    "0.02491103202846975": 298,
    "0.025": 299,
    "0.025069637883008356": 300,
    "0.025157232704402517": 301,
    "0.025210084033613446": 302,
    "0.02531645569620253": 303,
    "0.02535211267605634": 304,
    "0.025477707006369428": 305,
    "0.025495750708215296": 306,
    "0.02564102564102564": 307,
    "0.025974025974025976": 308,
    "0.02608695652173913": 309,
    "0.02631578947368421": 310,
    "0.026392961876832845": 311,
    "0.02654867256637168": 312,
    "0.026595744680851064": 313,
    "0.02666666666666667": 314,
    "0.026706231454005934": 315,
    "0.026785714285714284": 316,
    "0.026881720430107527": 317,
    "0.026923076923076925": 318,
    "0.02702702702702703": 319,
    "0.027131782945736434": 320,
    "0.027247956403269755": 321,
    "0.02727272727272727": 322,
    "0.0273972602739726": 323,
    "0.027472527472527472": 324,
    "0.027522935779816515": 325,
    "0.027559055118110236": 326,
    "0.027586206896551724": 327,
    "0.027649769585253458": 328,
    "0.02766798418972332": 329,
    "0.027700831024930747": 330,
    "0.027777777777777776": 331,
    "0.027972027972027972": 332,
    "0.028037383177570093": 333,
    "0.028089887640449437": 334,
    "0.028169014084507043": 335,
    "0.028205128205128206": 336,
    "0.02824858757062147": 337,
    "0.02830188679245283": 338,
    "0.02857142857142857": 339,
    "0.028735632183908046": 340,
    "0.02880658436213992": 341,
    "0.028846153846153848": 342,
    "0.028985507246376812": 343,
    "0.029069767441860465": 344,
    "0.02912621359223301": 345,
    "0.02926829268292683": 346,
    "0.029411764705882353": 347,
    "0.029498525073746312": 348,
    "0.029585798816568046": 349,
    "0.029661016949152543": 350,
    "0.02967359050445104": 351,
    "0.0297029702970297": 352,
    "0.02976190476190476": 353,
    "0.029850746268656716": 354,
    "0.03": 355,
    "0.030042918454935622": 356,
    "0.03007518796992481": 357,
    "0.030303030303030304": 358,
    "0.030456852791878174": 359,
    "0.030612244897959183": 360,
    "0.03076923076923077": 361,
    "0.030864197530864196": 362,
    "0.030973451327433628": 363,
    "0.031055900621118012": 364,
    "0.031088082901554404": 365,
    "0.03125": 366,
    "0.031413612565445025": 367,
    "0.031446540880503145": 368,
    "0.031578947368421054": 369,
    "0.03184713375796178": 370,
    "0.031914893617021274": 371,
    "0.032": 372,
    "0.03205128205128205": 373,
    "0.03225806451612903": 374,
    "0.032490974729241874": 375,
    "0.032520325203252036": 376,
    "0.032679738562091505": 377,
    "0.03278688524590164": 378,
    "0.03289473684210526": 379,
    "0.03296703296703297": 380,
    "0.033112582781456956": 381,
    "0.03333333333333333": 382,
    "0.03361344537815126": 383,
    "0.033707865168539325": 384,
    "0.033783783783783786": 385,
    "0.033962264150943396": 386,
    "0.034013605442176874": 387,
    "0.03414634146341464": 388,
    "0.03418803418803419": 389,
    "0.03431372549019608": 390,
    "0.034334763948497854": 391,
    "0.034375": 392,
    "0.034482758620689655": 393,
    "0.03468208092485549": 394,
    "0.034722222222222224": 395,
    "0.03482587064676617": 396,
    "0.03508771929824561": 397,
    "0.03514376996805112": 398,
    "0.03529411764705882": 399,
    "0.03535353535353535": 400,
    "0.035398230088495575": 401,
    "0.035483870967741936": 402,
    "0.03550295857988166": 403,
    "0.03553299492385787": 404,
    "0.03571428571428571": 405,
    "0.03581267217630854": 406,
    "0.035897435897435895": 407,
    "0.03592814371257485": 408,
    "0.036036036036036036": 409,
    "0.03614457831325301": 410,
    "0.036211699164345405": 411,
    "0.03626943005181347": 412,
    "0.03636363636363636": 413,
    "0.036544850498338874": 414,
    "0.036585365853658534": 415,
    "0.03664921465968586": 416,
    "0.03672316384180791": 417,
    "0.036827195467422094": 418,
    "0.037037037037037035": 419,
    "0.037267080745341616": 420,
    "0.03731343283582089": 421,
    "0.037383177570093455": 422,
    "0.0374331550802139": 423,
    "0.0375": 424,
    "0.03762376237623762": 425,
    "0.03773584905660377": 426,
    "0.03783783783783784": 427,
    "0.03787878787878788": 428,
    "0.03792415169660679": 429,
    "0.0379746835443038": 430,
    "0.03804347826086957": 431,
    "0.0380952380952381": 432,
    "0.03812316715542522": 433,
    "0.03816793893129771": 434,
    "0.03821656050955414": 435,
    "0.03825136612021858": 436,
    "0.038461538461538464": 437,
    "0.03856749311294766": 438,
    "0.03862660944206009": 439,
    "0.03875968992248062": 440,
    "0.03902439024390244": 441,
    "0.0392156862745098": 442,
    "0.03932584269662921": 443,
    "0.03937007874015748": 444,
    "0.03939393939393939": 445,
    "0.03940886699507389": 446,
    "0.039473684210526314": 447,
    "0.039525691699604744": 448,
    "0.03954802259887006": 449,
    "0.039603960396039604": 450,
    "0.039735099337748346": 451,
    "0.03980099502487562": 452,
    "0.039886039886039885": 453,
    "0.04": 454,
    "0.040229885057471264": 455,
    "0.04032258064516129": 456,
    "0.04040404040404041": 457,
    "0.04046242774566474": 458,
    "0.04048582995951417": 459,
    "0.04054054054054054": 460,
    "0.040697674418604654": 461,
    "0.04081632653061224": 462,
    "0.041025641025641026": 463,
    "0.0410958904109589": 464,
    "0.041237113402061855": 465,
    "0.04132231404958678": 466,
    "0.04142011834319527": 467,
    "0.041666666666666664": 468,
    "0.04178272980501393": 469,
    "0.04195804195804196": 470,
    "0.04201680672268908": 471,
    "0.042105263157894736": 472,
    "0.04216867469879518": 473,
    "0.042328042328042326": 474,
    "0.042492917847025496": 475,
    "0.0425531914893617": 476,
    "0.042682926829268296": 477,
    "0.042735042735042736": 478,
    "0.04285714285714286": 479,
    "0.04310344827586207": 480,
    "0.043209876543209874": 481,
    "0.043243243243243246": 482,
    "0.043478260869565216": 483,
    "0.043859649122807015": 484,
    "0.0440251572327044": 485,
    "0.04411764705882353": 486,
    "0.04424778761061947": 487,
    "0.04435483870967742": 488,
    "0.044444444444444446": 489,
    "0.044534412955465584": 490,
    "0.044585987261146494": 491,
    "0.044642857142857144": 492,
    "0.04477611940298507": 493,
    "0.04504504504504504": 494,
    "0.04516129032258064": 495,
    "0.045454545454545456": 496,
    "0.0457516339869281": 497,
    "0.04580152671755725": 498,
    "0.045871559633027525": 499,
    "0.04597701149425287": 500,
    "0.046052631578947366": 501,
    "0.046296296296296294": 502,
    "0.046511627906976744": 503,
    "0.04666666666666667": 504,
    "0.04669260700389105": 505,
    "0.04672897196261682": 506,
    "0.047058823529411764": 507,
    "0.04716981132075472": 508,
    "0.047337278106508875": 509,
    "0.047619047619047616": 510,
    "0.04778156996587031": 511,
    "0.04790419161676647": 512,
    "0.04794520547945205": 513,
    "0.04807692307692308": 514,
    "0.0481283422459893": 515,
    "0.04819277108433735": 516,
    "0.04827586206896552": 517,
    "0.04838709677419355": 518,
    "0.04854368932038835": 519,
    "0.04861111111111111": 520,
    "0.04878048780487805": 521,
    "0.04895104895104895": 522,
    "0.049019607843137254": 523,
    "0.04929577464788732": 524,
    "0.04938271604938271": 525,
    "0.04950495049504951": 526,
    "0.049586776859504134": 527,
    "0.04964539007092199": 528,
    "0.04985337243401759": 529,
    "0.05": 530,
    "0.050359712230215826": 531,
    "0.05040650406504065": 532,
    "0.05042016806722689": 533,
    "0.050505050505050504": 534,
    "0.050551470588235295": 535,
    "0.05056179775280899": 536,
    "0.05063291139240506": 537,
    "0.05084745762711865": 538,
    "0.05102040816326531": 539,
    "0.05128205128205128": 540,
    "0.05150214592274678": 541,
    "0.05154639175257732": 542,
    "0.05172413793103448": 543,
    "0.052083333333333336": 544,
    "0.05217391304347826": 545,
    "0.05241935483870968": 546,
    "0.05263157894736842": 547,
    "0.052980132450331126": 548,
    "0.05303030303030303": 549,
    "0.05309734513274336": 550,
    "0.05319148936170213": 551,
    "0.05333333333333334": 552,
    "0.05338078291814947": 553,
    "0.05357142857142857": 554,
    "0.05365853658536585": 555,
    "0.053763440860215055": 556,
    "0.05405405405405406": 557,
    "0.05454545454545454": 558,
    "0.0546875": 559,
    "0.0547945205479452": 560,
    "0.054878048780487805": 561,
    "0.05504587155963303": 562,
    "0.05514705882352941": 563,
    "0.05517241379310345": 564,
    "0.05555555555555555": 565,
    "0.05571847507331378": 566,
    "0.055944055944055944": 567,
    "0.056179775280898875": 568,
    "0.056338028169014086": 569,
    "0.056451612903225805": 570,
    "0.05660377358490566": 571,
    "0.056818181818181816": 572,
    "0.05714285714285714": 573,
    "0.05747126436781609": 574,
    "0.057692307692307696": 575,
    "0.05785123966942149": 576,
    "0.057971014492753624": 577,
    "0.05813953488372093": 578,
    "0.05851063829787234": 579,
    "0.058823529411764705": 580,
    "0.05905511811023622": 581,
    "0.05928853754940711": 582,
    "0.0594059405940594": 583,
    "0.05952380952380952": 584,
    "0.05970149253731343": 585,
    "0.059880239520958084": 586,
    "0.060240963855421686": 587,
    "0.06028368794326241": 588,
    "0.060498220640569395": 589,
    "0.06060606060606061": 590,
    "0.06097560975609756": 591,
    "0.06115107913669065": 592,
    "0.06140350877192982": 593,
    "0.06146926536731634": 594,
    "0.06164383561643835": 595,
    "0.06172839506172839": 596,
    "0.06179775280898876": 597,
    "0.061855670103092786": 598,
    "0.061946902654867256": 599,
    "0.0625": 600,
    "0.06274509803921569": 601,
    "0.06282722513089005": 602,
    "0.06293706293706294": 603,
    "0.06310679611650485": 604,
    "0.06329113924050633": 605,
    "0.06341463414634146": 606,
    "0.06349206349206349": 607,
    "0.06382978723404255": 608,
    "0.0641025641025641": 609,
    "0.06428571428571428": 610,
    "0.06451612903225806": 611,
    "0.06493506493506493": 612,
    "0.06542056074766354": 613,
    "0.06578947368421052": 614,
    "0.06593406593406594": 615,
    "0.0660377358490566": 616,
    "0.06642066420664207": 617,
    "0.06666666666666667": 618,
    "0.06756756756756757": 619,
    "0.06779661016949153": 620,
    "0.06818181818181818": 621,
    "0.06837606837606838": 622,
    "0.0684931506849315": 623,
    "0.06896551724137931": 624,
    "0.06930693069306931": 625,
    "0.06936416184971098": 626,
    "0.06944444444444445": 627,
    "0.06956521739130435": 628,
    "0.0695970695970696": 629,
    "0.06985294117647059": 630,
    "0.06993006993006994": 631,
    "0.07017543859649122": 632,
    "0.07079646017699115": 633,
    "0.07096774193548387": 634,
    "0.07106598984771574": 635,
    "0.07111111111111111": 636,
    "0.07142857142857142": 637,
    "0.07179487179487179": 638,
    "0.0718562874251497": 639,
    "0.0718954248366013": 640,
    "0.07228915662650602": 641,
    "0.07236842105263158": 642,
    "0.07246376811594203": 643,
    "0.07272727272727272": 644,
    "0.0728476821192053": 645,
    "0.07317073170731707": 646,
    "0.07339449541284404": 647,
    "0.07368421052631578": 648,
    "0.07407407407407407": 649,
    "0.07468123861566485": 650,
    "0.0748663101604278": 651,
    "0.075": 652,
    "0.07526881720430108": 653,
    "0.07547169811320754": 654,
    "0.0755813953488372": 655,
    "0.0759493670886076": 656,
    "0.07608695652173914": 657,
    "0.07624633431085044": 658,
    "0.07650273224043716": 659,
    "0.07723577235772358": 660,
    "0.07746478873239436": 661,
    "0.07799442896935933": 662,
    "0.078125": 663,
    "0.0782608695652174": 664,
    "0.0784313725490196": 665,
    "0.07887323943661972": 666,
    "0.07894736842105263": 667,
    "0.07936507936507936": 668,
    "0.07942238267148015": 669,
    "0.08": 670,
    "0.08035714285714286": 671,
    "0.08050847457627118": 672,
    "0.08058608058608059": 673,
    "0.08074534161490683": 674,
    "0.08088235294117647": 675,
    "0.08092485549132948": 676,
    "0.08108108108108109": 677,
    "0.08163265306122448": 678,
    "0.08174386920980926": 679,
    "0.08176100628930817": 680,
    "0.08191126279863481": 681,
    "0.08196721311475409": 682,
    "0.08211143695014662": 683,
    "0.08241758241758242": 684,
    "0.08270676691729323": 685,
    "0.0830860534124629": 686,
    "0.08316831683168317": 687,
    "0.08333333333333333": 688,
    "0.08376963350785341": 689,
    "0.08383233532934131": 690,
    "0.08403361344537816": 691,
    "0.08426966292134831": 692,
    "0.08433734939759036": 693,
    "0.08450704225352113": 694,
    "0.0847457627118644": 695,
    "0.08536585365853659": 696,
    "0.08547008547008547": 697,
    "0.08571428571428572": 698,
    "0.08585858585858586": 699,
    "0.08620689655172414": 700,
    "0.08641975308641975": 701,
    "0.08648648648648649": 702,
    "0.08653846153846154": 703,
    "0.08695652173913043": 704,
    "0.08717948717948718": 705,
    "0.0872093023255814": 706,
    "0.08743169398907104": 707,
    "0.08771929824561403": 708,
    "0.08791208791208792": 709,
    "0.08823529411764706": 710,
    "0.08849557522123894": 711,
    "0.08860759493670886": 712,
    "0.08870967741935484": 713,
    "0.09009009009009009": 714,
    "0.09014675052410902": 715,
    "0.09036144578313253": 716,
    "0.09090909090909091": 717,
    "0.09129511677282377": 718,
    "0.09174311926605505": 719,
    "0.09195402298850575": 720,
    "0.09259259259259259": 721,
    "0.09285714285714286": 722,
    "0.09302325581395349": 723,
    "0.09313725490196079": 724,
    "0.09316770186335403": 725,
    "0.09345794392523364": 726,
    "0.09401709401709402": 727,
    "0.09433962264150944": 728,
    "0.09465020576131687": 729,
    "0.09473684210526316": 730,
    "0.09482758620689655": 731,
    "0.0949367088607595": 732,
    "0.09523809523809523": 733,
    "0.09615384615384616": 734,
    "0.09649122807017543": 735,
    "0.0967741935483871": 736,
    "0.0970873786407767": 737,
    "0.09734513274336283": 738,
    "0.0975609756097561": 739,
    "0.09803921568627451": 740,
    "0.09821428571428571": 741,
    "0.0990990990990991": 742,
    "0.1": 743,
    "0.10027855153203342": 744,
    "0.10035941387890517": 745,
    "0.1004149377593361": 746,
    "0.10077519379844961": 747,
    "0.10084033613445378": 748,
    "0.10091743119266056": 749,
    "0.10101010101010101": 750,
    "0.10126582278481013": 751,
    "0.10164835164835165": 752,
    "0.1016949152542373": 753,
    "0.10185185185185185": 754,
    "0.1018867924528302": 755,
    "0.10198300283286119": 756,
    "0.10204081632653061": 757,
    "0.10249307479224377": 758,
    "0.102803738317757": 759,
    "0.10299003322259136": 760,
    "0.10300429184549356": 761,
    "0.10317460317460317": 762,
    "0.1032258064516129": 763,
    "0.10377358490566038": 764,
    "0.104": 765,
    "0.10416666666666667": 766,
    "0.10451977401129943": 767,
    "0.10476190476190476": 768,
    "0.10482180293501048": 769,
    "0.10483870967741936": 770,
    "0.10526315789473684": 771,
    "0.10543130990415335": 772,
    "0.10615711252653928": 773,
    "0.10619469026548672": 774,
    "0.10666666666666667": 775,
    "0.10679611650485436": 776,
    "0.10714285714285714": 777,
    "0.1072961373390558": 778,
    "0.1073170731707317": 779,
    "0.10743801652892562": 780,
    "0.10803324099722991": 781,
    "0.10810810810810811": 782,
    "0.10826210826210826": 783,
    "0.10891089108910891": 784,
    "0.1092896174863388": 785,
    "0.10931174089068826": 786,
    "0.10945273631840796": 787,
    "0.10989010989010989": 788,
    "0.11009174311926606": 789,
    "0.11016949152542373": 790,
    "0.11021505376344086": 791,
    "0.11029411764705882": 792,
    "0.11070110701107011": 793,
    "0.1111111111111111": 794,
    "0.1116751269035533": 795,
    "0.11235955056179775": 796,
    "0.11282051282051282": 797,
    "0.11284046692607004": 798,
    "0.11295681063122924": 799,
    "0.11299435028248588": 800,
    "0.11320754716981132": 801,
    "0.11331444759206799": 802,
    "0.11398963730569948": 803,
    "0.11403508771929824": 804,
    "0.11428571428571428": 805,
    "0.11486486486486487": 806,
    "0.11518324607329843": 807,
    "0.11560693641618497": 808,
    "0.11572700296735905": 809,
    "0.11643835616438356": 810,
    "0.116751269035533": 811,
    "0.11682242990654206": 812,
    "0.11702127659574468": 813,
    "0.11707317073170732": 814,
    "0.11724137931034483": 815,
    "0.11734693877551021": 816,
    "0.11764705882352941": 817,
    "0.1177771633950788": 818,
    "0.11799410029498525": 819,
    "0.11818181818181818": 820,
    "0.11822660098522167": 821,
    "0.11827956989247312": 822,
    "0.11839557399723374": 823,
    "0.11839708561020036": 824,
    "0.11842105263157894": 825,
    "0.1188118811881188": 826,
    "0.11940298507462686": 827,
    "0.11946902654867257": 828,
    "0.11956521739130435": 829,
    "0.11976047904191617": 830,
    "0.12": 831,
    "0.12037037037037036": 832,
    "0.1206896551724138": 833,
    "0.12087912087912088": 834,
    "0.1214574898785425": 835,
    "0.12149532710280374": 836,
    "0.12173913043478261": 837,
    "0.12195121951219512": 838,
    "0.12244897959183673": 839,
    "0.12256267409470752": 840,
    "0.12274368231046931": 841,
    "0.12280701754385964": 842,
    "0.12315270935960591": 843,
    "0.12345679012345678": 844,
    "0.12380952380952381": 845,
    "0.12389380530973451": 846,
    "0.125": 847,
    "0.12582781456953643": 848,
    "0.12612612612612611": 849,
    "0.1262135922330097": 850,
    "0.12643678160919541": 851,
    "0.1267605633802817": 852,
    "0.12727272727272726": 853,
    "0.12777777777777777": 854,
    "0.12806539509536785": 855,
    "0.1282051282051282": 856,
    "0.12834224598930483": 857,
    "0.12844036697247707": 858,
    "0.12903225806451613": 859,
    "0.12962962962962962": 860,
    "0.12972972972972974": 861,
    "0.13013698630136986": 862,
    "0.13055555555555556": 863,
    "0.1308411214953271": 864,
    "0.13095238095238096": 865,
    "0.13131313131313133": 866,
    "0.13157894736842105": 867,
    "0.13186813186813187": 868,
    "0.1320754716981132": 869,
    "0.1322314049586777": 870,
    "0.1326530612244898": 871,
    "0.13333333333333333": 872,
    "0.13402061855670103": 873,
    "0.1346153846153846": 874,
    "0.1348314606741573": 875,
    "0.13513513513513514": 876,
    "0.13541666666666666": 877,
    "0.13550135501355012": 878,
    "0.13559322033898305": 879,
    "0.13592233009708737": 880,
    "0.13636363636363635": 881,
    "0.13658536585365855": 882,
    "0.13675213675213677": 883,
    "0.1368421052631579": 884,
    "0.13714285714285715": 885,
    "0.13725490196078433": 886,
    "0.13793103448275862": 887,
    "0.13836477987421383": 888,
    "0.13861386138613863": 889,
    "0.13864306784660768": 890,
    "0.13872832369942195": 891,
    "0.1391304347826087": 892,
    "0.13930348258706468": 893,
    "0.13953488372093023": 894,
    "0.13986013986013987": 895,
    "0.14018691588785046": 896,
    "0.14035087719298245": 897,
    "0.1411764705882353": 898,
    "0.14150943396226415": 899,
    "0.1415929203539823": 900,
    "0.1417910447761194": 901,
    "0.14213197969543148": 902,
    "0.1424287856071964": 903,
    "0.14285714285714285": 904,
    "0.14358974358974358": 905,
    "0.1436950146627566": 906,
    "0.14444444444444443": 907,
    "0.14447592067988668": 908,
    "0.14457831325301204": 909,
    "0.1450381679389313": 910,
    "0.14507772020725387": 911,
    "0.14516129032258066": 912,
    "0.14545454545454545": 913,
    "0.14594594594594595": 914,
    "0.14606741573033707": 915,
    "0.14634146341463414": 916,
    "0.14646464646464646": 917,
    "0.14659685863874344": 918,
    "0.14673913043478262": 919,
    "0.14705882352941177": 920,
    "0.14772727272727273": 921,
    "0.1485148514851485": 922,
    "0.14871794871794872": 923,
    "0.14942528735632185": 924,
    "0.1497005988023952": 925,
    "0.15": 926,
    "0.15025906735751296": 927,
    "0.15172413793103448": 928,
    "0.1518987341772152": 929,
    "0.1523809523809524": 930,
    "0.1527777777777778": 931,
    "0.15294117647058825": 932,
    "0.15306122448979592": 933,
    "0.15384615384615385": 934,
    "0.15476190476190477": 935,
    "0.15483870967741936": 936,
    "0.15503875968992248": 937,
    "0.15517241379310345": 938,
    "0.15584415584415584": 939,
    "0.15625": 940,
    "0.1566265060240964": 941,
    "0.1568627450980392": 942,
    "0.1569767441860465": 943,
    "0.15702479338842976": 944,
    "0.15706806282722513": 945,
    "0.15757575757575756": 946,
    "0.15789473684210525": 947,
    "0.15853658536585366": 948,
    "0.15873015873015872": 949,
    "0.1595744680851064": 950,
    "0.16": 951,
    "0.16049382716049382": 952,
    "0.16129032258064516": 953,
    "0.16149068322981366": 954,
    "0.16161616161616163": 955,
    "0.16176470588235295": 956,
    "0.16216216216216217": 957,
    "0.1625": 958,
    "0.16268382352941177": 959,
    "0.16346153846153846": 960,
    "0.16417910447761194": 961,
    "0.16428571428571428": 962,
    "0.1643835616438356": 963,
    "0.16455696202531644": 964,
    "0.16489361702127658": 965,
    "0.16613418530351437": 966,
    "0.16666666666666666": 967,
    "0.16766467065868262": 968,
    "0.16774193548387098": 969,
    "0.16783216783216784": 970,
    "0.16804407713498623": 971,
    "0.16806722689075632": 972,
    "0.16822429906542055": 973,
    "0.1686746987951807": 974,
    "0.16875": 975,
    "0.16883116883116883": 976,
    "0.16891891891891891": 977,
    "0.16901408450704225": 978,
    "0.16991643454038996": 979,
    "0.16993464052287582": 980,
    "0.17054263565891473": 981,
    "0.17073170731707318": 982,
    "0.17105263157894737": 983,
    "0.17117117117117117": 984,
    "0.17123287671232876": 985,
    "0.17142857142857143": 986,
    "0.17159763313609466": 987,
    "0.17231638418079095": 988,
    "0.1724137931034483": 989,
    "0.17280453257790368": 990,
    "0.17307692307692307": 991,
    "0.1732283464566929": 992,
    "0.17333333333333334": 993,
    "0.1736111111111111": 994,
    "0.1737891737891738": 995,
    "0.17391304347826086": 996,
    "0.17398373983739837": 997,
    "0.17419354838709677": 998,
    "0.1746031746031746": 999,
    "0.175": 1000,
    "0.17623762376237623": 1001,
    "0.17647058823529413": 1002,
    "0.17721518987341772": 1003,
    "0.1773049645390071": 1004,
    "0.1774193548387097": 1005,
    "0.17764471057884232": 1006,
    "0.17793594306049823": 1007,
    "0.1780821917808219": 1008,
    "0.1791044776119403": 1009,
    "0.1797752808988764": 1010,
    "0.17985611510791366": 1011,
    "0.17989417989417988": 1012,
    "0.1801470588235294": 1013,
    "0.18025751072961374": 1014,
    "0.18055555555555555": 1015,
    "0.1814516129032258": 1016,
    "0.18292682926829268": 1017,
    "0.18333333333333332": 1018,
    "0.18475073313782991": 1019,
    "0.18518518518518517": 1020,
    "0.1859504132231405": 1021,
    "0.18633540372670807": 1022,
    "0.1864406779661017": 1023,
    "0.1875": 1024,
    "0.18840579710144928": 1025,
    "0.18867924528301888": 1026,
    "0.18974358974358974": 1027,
    "0.19047619047619047": 1028,
    "0.1910828025477707": 1029,
    "0.1917808219178082": 1030,
    "0.19230769230769232": 1031,
    "0.1925133689839572": 1032,
    "0.1937984496124031": 1033,
    "0.19402985074626866": 1034,
    "0.19469026548672566": 1035,
    "0.19491525423728814": 1036,
    "0.1951219512195122": 1037,
    "0.19607843137254902": 1038,
    "0.19642857142857142": 1039,
    "0.19736842105263158": 1040,
    "0.1981981981981982": 1041,
    "0.1986754966887417": 1042,
    "0.2": 1043,
    "0.20192307692307693": 1044,
    "0.20218579234972678": 1045,
    "0.20261437908496732": 1046,
    "0.20270270270270271": 1047,
    "0.20394736842105263": 1048,
    "0.20408163265306123": 1049,
    "0.20666666666666667": 1050,
    "0.20710059171597633": 1051,
    "0.20754716981132076": 1052,
    "0.2112676056338028": 1053,
    "0.21153846153846154": 1054,
    "0.21212121212121213": 1055,
    "0.21296296296296297": 1056,
    "0.2131979695431472": 1057,
    "0.2146341463414634": 1058,
    "0.2150170648464164": 1059,
    "0.22340425531914893": 1060,
    "0.22758620689655173": 1061,
    "0.3076923076923077": 1062,
    "0.32432432432432434": 1063,
    "0.330188679245283": 1064,
    "0.34146341463414637": 1065,
    "0.3431372549019608": 1066,
    "0.34328358208955223": 1067,
    "0.3434343434343434": 1068,
    "0.3443223443223443": 1069,
    "0.3448275862068966": 1070,
    "0.3469387755102041": 1071,
    "0.34782608695652173": 1072,
    "0.34831460674157305": 1073,
    "0.3492063492063492": 1074,
    "0.35": 1075,
    "0.3505747126436782": 1076,
    "0.352": 1077,
    "0.3526170798898072": 1078,
    "0.35294117647058826": 1079,
    "0.35353535353535354": 1080,
    "0.35365853658536583": 1081,
    "0.35384615384615387": 1082,
    "0.35398230088495575": 1083,
    "0.3548387096774194": 1084,
    "0.3557692307692308": 1085,
    "0.3563218390804598": 1086,
    "0.35638297872340424": 1087,
    "0.35714285714285715": 1088,
    "0.35802469135802467": 1089,
    "0.35978835978835977": 1090,
    "0.36": 1091,
    "0.36036036036036034": 1092,
    "0.3611111111111111": 1093,
    "0.3612565445026178": 1094,
    "0.36129032258064514": 1095,
    "0.3614457831325301": 1096,
    "0.3617021276595745": 1097,
    "0.36186770428015563": 1098,
    "0.3620689655172414": 1099,
    "0.362116991643454": 1100,
    "0.3625": 1101,
    "0.3626062322946176": 1102,
    "0.36283185840707965": 1103,
    "0.36363636363636365": 1104,
    "0.3643410852713178": 1105,
    "0.3644067796610169": 1106,
    "0.3644859813084112": 1107,
    "0.3645833333333333": 1108,
    "0.36470588235294116": 1109,
    "0.36538461538461536": 1110,
    "0.36585365853658536": 1111,
    "0.3660130718954248": 1112,
    "0.366120218579235": 1113,
    "0.36627906976744184": 1114,
    "0.36633663366336633": 1115,
    "0.36666666666666664": 1116,
    "0.3670886075949367": 1117,
    "0.3673469387755102": 1118,
    "0.36752136752136755": 1119,
    "0.36792452830188677": 1120,
    "0.3684210526315789": 1121,
    "0.3686868686868687": 1122,
    "0.36936936936936937": 1123,
    "0.37037037037037035": 1124,
    "0.37055837563451777": 1125,
    "0.3707865168539326": 1126,
    "0.3709677419354839": 1127,
    "0.37142857142857144": 1128,
    "0.37244897959183676": 1129,
    "0.37254901960784315": 1130,
    "0.37267080745341613": 1131,
    "0.37272727272727274": 1132,
    "0.3728813559322034": 1133,
    "0.373015873015873": 1134,
    "0.373134328358209": 1135,
    "0.37349397590361444": 1136,
    "0.37435897435897436": 1137,
    "0.375": 1138,
    "0.375609756097561": 1139,
    "0.3756345177664975": 1140,
    "0.375886524822695": 1141,
    "0.375968992248062": 1142,
    "0.37606837606837606": 1143,
    "0.3761467889908257": 1144,
    "0.3764705882352941": 1145,
    "0.37735849056603776": 1146,
    "0.3776223776223776": 1147,
    "0.3776978417266187": 1148,
    "0.37815126050420167": 1149,
    "0.37823834196891193": 1150,
    "0.37888198757763975": 1151,
    "0.3793103448275862": 1152,
    "0.37943262411347517": 1153,
    "0.37948717948717947": 1154,
    "0.37950138504155123": 1155,
    "0.37962962962962965": 1156,
    "0.38016528925619836": 1157,
    "0.38028169014084506": 1158,
    "0.3805668016194332": 1159,
    "0.38071065989847713": 1160,
    "0.3807829181494662": 1161,
    "0.3816793893129771": 1162,
    "0.38186813186813184": 1163,
    "0.38202247191011235": 1164,
    "0.38235294117647056": 1165,
    "0.3826086956521739": 1166,
    "0.38271604938271603": 1167,
    "0.3828125": 1168,
    "0.38317757009345793": 1169,
    "0.38333333333333336": 1170,
    "0.38345864661654133": 1171,
    "0.3835616438356164": 1172,
    "0.3836477987421384": 1173,
    "0.38392857142857145": 1174,
    "0.38414634146341464": 1175,
    "0.3841642228739003": 1176,
    "0.38461538461538464": 1177,
    "0.38482384823848237": 1178,
    "0.3850574712643678": 1179,
    "0.38526912181303113": 1180,
    "0.3853211009174312": 1181,
    "0.3855421686746988": 1182,
    "0.38596491228070173": 1183,
    "0.38613861386138615": 1184,
    "0.38620689655172413": 1185,
    "0.38666666666666666": 1186,
    "0.3867924528301887": 1187,
    "0.3869047619047619": 1188,
    "0.3870967741935484": 1189,
    "0.3873239436619718": 1190,
    "0.387434554973822": 1191,
    "0.3875": 1192,
    "0.3877551020408163": 1193,
    "0.3878504672897196": 1194,
    "0.3880597014925373": 1195,
    "0.3881578947368421": 1196,
    "0.38823529411764707": 1197,
    "0.3882978723404255": 1198,
    "0.3883495145631068": 1199,
    "0.3888888888888889": 1200,
    "0.3890784982935154": 1201,
    "0.3896551724137931": 1202,
    "0.3897058823529412": 1203,
    "0.3902439024390244": 1204,
    "0.39037433155080214": 1205,
    "0.3904109589041096": 1206,
    "0.3904761904761905": 1207,
    "0.3905579399141631": 1208,
    "0.39072847682119205": 1209,
    "0.3912175648702595": 1210,
    "0.3920792079207921": 1211,
    "0.39215686274509803": 1212,
    "0.3926553672316384": 1213,
    "0.39285714285714285": 1214,
    "0.3930232558139535": 1215,
    "0.3930635838150289": 1216,
    "0.3933333333333333": 1217,
    "0.39344262295081966": 1218,
    "0.3942307692307692": 1219,
    "0.3944954128440367": 1220,
    "0.39473684210526316": 1221,
    "0.39490445859872614": 1222,
    "0.3949579831932773": 1223,
    "0.3950617283950617": 1224,
    "0.3951612903225806": 1225,
    "0.3953488372093023": 1226,
    "0.39552238805970147": 1227,
    "0.3956043956043956": 1228,
    "0.39615384615384613": 1229,
    "0.3963963963963964": 1230,
    "0.39655172413793105": 1231,
    "0.3967391304347826": 1232,
    "0.3971119133574007": 1233,
    "0.3973509933774834": 1234,
    "0.3975609756097561": 1235,
    "0.39759036144578314": 1236,
    "0.3977272727272727": 1237,
    "0.3978494623655914": 1238,
    "0.3979591836734694": 1239,
    "0.39805825242718446": 1240,
    "0.39814814814814814": 1241,
    "0.39823008849557523": 1242,
    "0.39869281045751637": 1243,
    "0.3989071038251366": 1244,
    "0.3993610223642173": 1245,
    "0.4": 1246,
    "0.4009433962264151": 1247,
    "0.40119760479041916": 1248,
    "0.40131578947368424": 1249,
    "0.40186915887850466": 1250,
    "0.4019607843137255": 1251,
    "0.4019933554817276": 1252,
    "0.4020618556701031": 1253,
    "0.40217391304347827": 1254,
    "0.4022140221402214": 1255,
    "0.40229885057471265": 1256,
    "0.4024390243902439": 1257,
    "0.4025157232704403": 1258,
    "0.4027777777777778": 1259,
    "0.40310077519379844": 1260,
    "0.4032258064516129": 1261,
    "0.40329218106995884": 1262,
    "0.4033970276008493": 1263,
    "0.40350877192982454": 1264,
    "0.4036697247706422": 1265,
    "0.40384615384615385": 1266,
    "0.40397350993377484": 1267,
    "0.4041095890410959": 1268,
    "0.40441176470588236": 1269,
    "0.4044943820224719": 1270,
    "0.40487804878048783": 1271,
    "0.4049586776859504": 1272,
    "0.40522875816993464": 1273,
    "0.40540540540540543": 1274,
    "0.40551181102362205": 1275,
    "0.4056603773584906": 1276,
    "0.4057971014492754": 1277,
    "0.40625": 1278,
    "0.4066666666666667": 1279,
    "0.4067796610169492": 1280,
    "0.40707964601769914": 1281,
    "0.40711462450592883": 1282,
    "0.4074074074074074": 1283,
    "0.40784313725490196": 1284,
    "0.40816326530612246": 1285,
    "0.40869565217391307": 1286,
    "0.4090909090909091": 1287,
    "0.40929535232383807": 1288,
    "0.40947075208913647": 1289,
    "0.4095238095238095": 1290,
    "0.41002949852507375": 1291,
    "0.41025641025641024": 1292,
    "0.41040462427745666": 1293,
    "0.4105263157894737": 1294,
    "0.4111111111111111": 1295,
    "0.411214953271028": 1296,
    "0.41132075471698115": 1297,
    "0.4114441416893733": 1298,
    "0.41150442477876104": 1299,
    "0.4117647058823529": 1300,
    "0.41201716738197425": 1301,
    "0.41216216216216217": 1302,
    "0.41228070175438597": 1303,
    "0.41237113402061853": 1304,
    "0.4125874125874126": 1305,
    "0.41348973607038125": 1306,
    "0.41379310344827586": 1307,
    "0.4144736842105263": 1308,
    "0.4146341463414634": 1309,
    "0.41483516483516486": 1310,
    "0.41509433962264153": 1311,
    "0.4155844155844156": 1312,
    "0.4158415841584158": 1313,
    "0.4166666666666667": 1314,
    "0.4174757281553398": 1315,
    "0.4177215189873418": 1316,
    "0.4177777777777778": 1317,
    "0.4187192118226601": 1318,
    "0.41935483870967744": 1319,
    "0.4195804195804196": 1320,
    "0.41975308641975306": 1321,
    "0.419811320754717": 1322,
    "0.4205607476635514": 1323,
    "0.42073170731707316": 1324,
    "0.42105263157894735": 1325,
    "0.4215686274509804": 1326,
    "0.42168674698795183": 1327,
    "0.4222222222222222": 1328,
    "0.4222873900293255": 1329,
    "0.4228855721393035": 1330,
    "0.4230769230769231": 1331,
    "0.4235294117647059": 1332,
    "0.42483660130718953": 1333,
    "0.4249084249084249": 1334,
    "0.425": 1335,
    "0.4251497005988024": 1336,
    "0.42528735632183906": 1337,
    "0.42574257425742573": 1338,
    "0.4260355029585799": 1339,
    "0.4264705882352941": 1340,
    "0.4265536723163842": 1341,
    "0.4266666666666667": 1342,
    "0.42729970326409494": 1343,
    "0.42758620689655175": 1344,
    "0.428169014084507": 1345,
    "0.42857142857142855": 1346,
    "0.42990654205607476": 1347,
    "0.43037974683544306": 1348,
    "0.4305555555555556": 1349,
    "0.4318181818181818": 1350,
    "0.4322916666666667": 1351,
    "0.43243243243243246": 1352,
    "0.43356643356643354": 1353,
    "0.43414634146341463": 1354,
    "0.4342105263157895": 1355,
    "0.43478260869565216": 1356,
    "0.43529411764705883": 1357,
    "0.4358974358974359": 1358,
    "0.43661971830985913": 1359,
    "0.4368932038834951": 1360,
    "0.4375": 1361,
    "0.4378698224852071": 1362,
    "0.44": 1363,
    "0.4408014571948998": 1364,
    "0.44594594594594594": 1365,
    "0.44680851063829785": 1366,
    "0.4520547945205479": 1367,
    "0.4528301886792453": 1368,
    "0.4550561797752809": 1369,
    "0.4605263157894737": 1370,
    "0.46285714285714286": 1371,
    "0.47368421052631576": 1372,
    "0.4919786096256685": 1373,
    "0.6310880829015544": 1374,
    "1": 1375,
    "10": 1376,
    "100": 1377,
    "1003": 1378,
    "1004": 1379,
    "1007": 1380,
    "101": 1381,
    "1011": 1382,
    "1012": 1383,
    "1013": 1384,
    "1015": 1385,
    "102": 1386,
    "1020": 1387,
    "1021": 1388,
    "1022": 1389,
    "1026": 1390,
    "103": 1391,
    "1030": 1392,
    "1035": 1393,
    "1036": 1394,
    "1037": 1395,
    "104": 1396,
    "10406": 1397,
    "1043": 1398,
    "1044": 1399,
    "105": 1400,
    "1052": 1401,
    "1057": 1402,
    "1059": 1403,
    "106": 1404,
    "1066": 1405,
    "1067": 1406,
    "107": 1407,
    "1070": 1408,
    "1071": 1409,
    "1072": 1410,
    "1074": 1411,
    "1075": 1412,
    "1077": 1413,
    "108": 1414,
    "1080": 1415,
    "1082": 1416,
    "1087": 1417,
    "1088": 1418,
    "1089": 1419,
    "109": 1420,
    "1090": 1421,
    "1093": 1422,
    "1094": 1423,
    "1095": 1424,
    "1097": 1425,
    "1098": 1426,
    "1099": 1427,
    "11": 1428,
    "110": 1429,
    "111": 1430,
    "1112": 1431,
    "1113": 1432,
    "1114": 1433,
    "1115": 1434,
    "1116": 1435,
    "1118": 1436,
    "1119": 1437,
    "112": 1438,
    "113": 1439,
    "1131": 1440,
    "1132": 1441,
    "1133": 1442,
    "1138": 1443,
    "114": 1444,
    "1148": 1445,
    "1149": 1446,
    "115": 1447,
    "1151": 1448,
    "1154": 1449,
    "1155": 1450,
    "1159": 1451,
    "116": 1452,
    "1161": 1453,
    "1162": 1454,
    "1166": 1455,
    "117": 1456,
    "118": 1457,
    "1189": 1458,
    "119": 1459,
    "1190": 1460,
    "1194": 1461,
    "1195": 1462,
    "1197": 1463,
    "12": 1464,
    "120": 1465,
    "1204": 1466,
    "1205": 1467,
    "1209": 1468,
    "121": 1469,
    "122": 1470,
    "1229": 1471,
    "123": 1472,
    "1232": 1473,
    "124": 1474,
    "1240": 1475,
    "1243": 1476,
    "1246": 1477,
    "1249": 1478,
    "125": 1479,
    "1250": 1480,
    "1251": 1481,
    "1258": 1482,
    "126": 1483,
    "1260": 1484,
    "1261": 1485,
    "1262": 1486,
    "1264": 1487,
    "1265": 1488,
    "127": 1489,
    "1270": 1490,
    "1274": 1491,
    "1275": 1492,
    "128": 1493,
    "1289": 1494,
    "129": 1495,
    "1299": 1496,
    "13": 1497,
    "130": 1498,
    "1300": 1499,
    "1303": 1500,
    "1306": 1501,
    "131": 1502,
    "1317": 1503,
    "1318": 1504,
    "132": 1505,
    "1325": 1506,
    "133": 1507,
    "1334": 1508,
    "1339": 1509,
    "134": 1510,
    "135": 1511,
    "1353": 1512,
    "1355": 1513,
    "136": 1514,
    "137": 1515,
    "1376": 1516,
    "138": 1517,
    "139": 1518,
    "1399": 1519,
    "14": 1520,
    "140": 1521,
    "1403": 1522,
    "14033": 1523,
    "1405": 1524,
    "1409": 1525,
    "141": 1526,
    "1412": 1527,
    "1414": 1528,
    "142": 1529,
    "1420": 1530,
    "1424": 1531,
    "1425": 1532,
    "1426": 1533,
    "143": 1534,
    "1437": 1535,
    "1438": 1536,
    "144": 1537,
    "1445": 1538,
    "1446": 1539,
    "145": 1540,
    "1450": 1541,
    "146": 1542,
    "1462": 1543,
    "1463": 1544,
    "147": 1545,
    "1471": 1546,
    "1477": 1547,
    "1478": 1548,
    "1479": 1549,
    "148": 1550,
    "1488": 1551,
    "149": 1552,
    "1490": 1553,
    "1496": 1554,
    "15": 1555,
    "150": 1556,
    "151": 1557,
    "1513": 1558,
    "1516": 1559,
    "1519": 1560,
    "152": 1561,
    "1520": 1562,
    "1521": 1563,
    "1522": 1564,
    "1523": 1565,
    "153": 1566,
    "1532": 1567,
    "1539": 1568,
    "154": 1569,
    "155": 1570,
    "1551": 1571,
    "1554": 1572,
    "1558": 1573,
    "1559": 1574,
    "156": 1575,
    "1561": 1576,
    "157": 1577,
    "158": 1578,
    "1584": 1579,
    "1585": 1580,
    "1587": 1581,
    "159": 1582,
    "16": 1583,
    "160": 1584,
    "1600": 1585,
    "1601": 1586,
    "161": 1587,
    "1611": 1588,
    "1614": 1589,
    "162": 1590,
    "163": 1591,
    "1636": 1592,
    "164": 1593,
    "165": 1594,
    "166": 1595,
    "167": 1596,
    "168": 1597,
    "1686": 1598,
    "169": 1599,
    "1692": 1600,
    "1697": 1601,
    "17": 1602,
    "170": 1603,
    "171": 1604,
    "1712": 1605,
    "1713": 1606,
    "1716": 1607,
    "172": 1608,
    "1723": 1609,
    "173": 1610,
    "1730": 1611,
    "1739": 1612,
    "174": 1613,
    "1741": 1614,
    "1742": 1615,
    "175": 1616,
    "1756": 1617,
    "176": 1618,
    "1766": 1619,
    "1767": 1620,
    "177": 1621,
    "1771": 1622,
    "178": 1623,
    "1785": 1624,
    "179": 1625,
    "18": 1626,
    "180": 1627,
    "1805": 1628,
    "1808": 1629,
    "1809": 1630,
    "181": 1631,
    "182": 1632,
    "183": 1633,
    "1830": 1634,
    "1833": 1635,
    "1834": 1636,
    "184": 1637,
    "185": 1638,
    "186": 1639,
    "1862": 1640,
    "1866": 1641,
    "1868": 1642,
    "187": 1643,
    "1872": 1644,
    "1875": 1645,
    "188": 1646,
    "1884": 1647,
    "189": 1648,
    "19": 1649,
    "190": 1650,
    "1901": 1651,
    "1903": 1652,
    "1907": 1653,
    "1909": 1654,
    "191": 1655,
    "1912": 1656,
    "192": 1657,
    "193": 1658,
    "1934": 1659,
    "1937": 1660,
    "194": 1661,
    "195": 1662,
    "1954": 1663,
    "1958": 1664,
    "1959": 1665,
    "196": 1666,
    "1962": 1667,
    "197": 1668,
    "1973": 1669,
    "198": 1670,
    "1980": 1671,
    "1982": 1672,
    "1986": 1673,
    "199": 1674,
    "2": 1675,
    "20": 1676,
    "200": 1677,
    "2004": 1678,
    "2006": 1679,
    "2008": 1680,
    "201": 1681,
    "2017": 1682,
    "2018": 1683,
    "2019": 1684,
    "202": 1685,
    "2021": 1686,
    "203": 1687,
    "2030": 1688,
    "2032": 1689,
    "2036": 1690,
    "204": 1691,
    "2048": 1692,
    "205": 1693,
    "206": 1694,
    "2062": 1695,
    "2063": 1696,
    "2064": 1697,
    "2066": 1698,
    "2069": 1699,
    "207": 1700,
    "2071": 1701,
    "2072": 1702,
    "2079": 1703,
    "208": 1704,
    "2081": 1705,
    "209": 1706,
    "2099": 1707,
    "21": 1708,
    "210": 1709,
    "2106": 1710,
    "2107": 1711,
    "2109": 1712,
    "211": 1713,
    "2114": 1714,
    "2119": 1715,
    "212": 1716,
    "2120": 1717,
    "2122": 1718,
    "2129": 1719,
    "213": 1720,
    "2135": 1721,
    "214": 1722,
    "215": 1723,
    "2150": 1724,
    "2157": 1725,
    "2158": 1726,
    "2159": 1727,
    "216": 1728,
    "2167": 1729,
    "2168": 1730,
